Version2/TestTool-Fosters/TestTool.Setup/Requests/DeviceMngmt/SetDNS/TC.DM.NVT.09_REQ_01.xml

<?xml version='1.0' encoding='utf-8'?>
<s:Envelope
 xmlns:s="http://www.w3.org/2003/05/soap-envelope"
 xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <s:Body>
    <tds:SetDNS>
      <tds:FromDHCP>true</tds:FromDHCP>
    </tds:SetDNS>
  </s:Body>
</s:Envelope>